app/controllers/api/v1/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    @issues = Issue.all.sort { |issue| issue.votes }

INSERT INTO "categories" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Category"], ["created_at", "2019-03-25 19:27:36.558018"], ["updated_at", "2019-03-25 19:27:36.558018"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."category" = $1 LIMIT $2  [["category", "traffic"], ["LIMIT", 1]]
INSERT INTO "issues" ("title", "zipcode", "votes", "category_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "xyz"], ["zipcode", 12345], ["votes", 0], ["category_id", 1], ["description", "xr"], ["created_at", "2019-03-25 19:19:30.952147"], ["updated_at", "2019-03-25 19:19:30.952147"]]
---
  def create
    @category = Category.find_or_create_by(title: params[:category])
    @issue = Issue.new(title: params[:title], description: params[:description], zipcode: params[:zipcode], category_id: @category.id, votes: 0, resolved: false)

    if @issue.save

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "issues" SET "votes" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["votes", 1], ["updated_at", "2019-03-25 22:04:18.681045"], ["id", 1]]
---
  def upvote
    issue = Issue.find(params[:id])

    issue.votes += 1
    issue.save

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "issues" SET "votes" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["votes", 2], ["updated_at", "2019-03-25 22:04:38.536999"], ["id", 1]]
---
  def downvote
    issue = Issue.find(params[:id])

    issue.votes -= 1
    issue.save